# UnableToLoadAttachedGroup Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToLoadAttachedGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to load attached detail group '[Type Name]'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToLoadAttachedGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToLoadAttachedGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToLoadAttachedGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace